def q1() :
    """
    ex)
        ****
        ****
        ****
        ****
    """
    width = int(input("너비 :"))
    height = int(input("높이 :"))

    for i in range(0, height) :
        for i in range(0, width) :
            print("*", end = '')
        print()

q1()

print("--------------------------------------------------------------------------------------------------------")


def q2() :
    """
    사용자로부터 입력받은 구구단을 출력하시오.
    """
    demand = int(input("단수 : "))
    for i in range(1, 10) :
        print(f"{demand} * {i} = {demand*i}")

q2()

print("--------------------------------------------------------------------------------------------------------")


def q3() :
    """
    2단부터 9단까지 구구단을 출력하시오.
    """
    for i in range(2, 10) :
        for j in range(1, 10) :
            print(f"{i} * {j} = {i*j}")
        print("----------------")
q3()

print("--------------------------------------------------------------------------------------------------------")

def q4() :
    """
    2단부터 9단까지 구구단을 출력하시오.
    가로방향으로 출력하시오.
    """
    for i in range(1, 10) :
        for j in range(2, 10) :
            print(f"| {j} * {i} = {j*i}", end = ' ')
        print()
q4()


def q4_1() :
    """
    2단부터 9단까지 구구단을 출력하시오.
    단, 일정 간격의 가로방향으로 출력하시오
    """
    for i in range(1, 10) :
        for j in range(2, 10) :
            if j*i < 10 :
                print(f"| {j} * {i} =  {j*i}", end = ' ')
            else :
                print(f"| {j} * {i} = {j*i}", end = ' ')
        print()
q4_1()

print("--------------------------------------------------------------------------------------------------------")

def q5() :
     """ 사용자가 입력한 너비와 높이의 직각삼각형을 그리세요.
        직각은 밑변의 좌측에 위치합니다.
    ex) 4 * 4
        *
        **
        ***
        ****
    """
     imp = int(input("빗변의 길이 :"))
     for i in range(0, imp) :
          print("*"*i)
q5()

print("--------------------------------------------------------------------------------------------------------")

def q6() :
    """ 사용자가 입력한 너비와 높이의 직각삼각형을 그리세요.
        직각은 밑변의 우측에 위치합니다.
    ex) 4 * 4
           *
          **
         ***
        ****
    """
    imp = int(input("빗변의 길이 :"))
    for i in range(0, imp) :
          print(" "*(imp-i) + "*"*i)
q6()

print("--------------------------------------------------------------------------------------------------------")


def q7() :
    """
    한 변의 길이가 사용자의 입력값인 다이아몬드를 그리세요.
    ex) imp = 5
             *
            ***
           *****
          *******
         *********
          *******
           *****
            ***
             *
    """
    imp = int(input("빗변의 길이 :"))
    for i in range(0, imp + 1) :
        print(' '*(imp-i) + "*"+"**"*i)
    for i in range(1, imp+1) :
        print(' '*i + "*"+"**"*(imp-i))
q7()

def q7() :
    imp = int(input("빗변의 길이 :"))
    for i in range(0, imp+1) :
        print(" "*(imp - i) + "*"*(2*i-1))
    for j in range(1, imp):
        print(" "*(j-1), "*"*(2*(imp-j)-1))
q7()